---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInDesignOption
source: html/947be4c5-3aa2-90e1-0ca2-22ee3679e5a0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInDesignOption Property

A pad in the main model cannot be hosted by topography in a Design Option [--if you continue it will not be added to the design option set].

## Syntax (C#)
```csharp
public static FailureDefinitionId ConfusingPadByElementsInDesignOption { get; }
```